tests/fixtures/test_src/Catalogs/ктв_сб_СобытияОбработчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ктв_сб_СобытияОбработчики</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

tests/fixtures/test_src/Catalogs/ктв_сб_СобытияОбработчики/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СсылкаНаОбъект = Объект.Ссылка;
	Если Параметры.Свойство("ЗначениеКопирования") Тогда
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			СсылкаНаОбъект = Параметры.ЗначениеКопирования;
		КонецЕсли;
	КонецЕсли;
	
	ктв_сб_ОбработкиОбслуживания.ОбъектПриСозданииНаСервере(Отказ
													   , СтандартнаяОбработка
													   , ЭтаФорма
													   , СсылкаНаОбъект
													   , ОбработкаПараметры.ПутьКДаннымОбработка
													   , ОбработкаПараметры.ПутьКДаннымОбработкаАдресВХранилище
													   , ОбработкаПараметры.ПутьКДаннымОбработкаПредставление
													   , ОбработкаПараметры.ИмяЭлементаВыбораОбработкиНаФорме
													   , ОбработкаПараметры.ПутьКДаннымОбработкаНастройки
													   , ОбработкаПараметры.ПутьКДаннымОбработкаНастройкиАдресВХранилище);
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ид = СокрЛП(Новый УникальныйИдентификатор);
	КонецЕсли; 
													   
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыНастройки" И Параметр = ЭтаФорма Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ид) Тогда
		Объект.Ид = СокрЛП(Новый УникальныйИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ктв_сб_ОбработкиОбслуживания.ОбъектПередЗаписьюНаСервере(Отказ
														, ТекущийОбъект
														, ПараметрыЗаписи
														, ЭтаФорма
														, ОбработкаПараметры.ПутьКДаннымОбработка
														, ОбработкаПараметры.ПутьКДаннымОбработкаАдресВХранилище
														, ОбработкаПараметры.ПутьКДаннымОбработкаНастройки
														, ОбработкаПараметры.ПутьКДаннымОбработкаНастройкиАдресВХранилище);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбработкаОбслуживанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ктв_сб_ОбработкиОбслуживанияКлиент.ОбработкаОбслуживанияНачалоВыбора(Элемент
																	, ДанныеВыбора
																	, СтандартнаяОбработка
																	, ЭтаФорма
																	, ОбработкаПараметры.ПутьКДаннымОбработкаАдресВХранилище
																	, ОбработкаПараметры.ПутьКДаннымОбработкаПредставление
																	, ОбработкаПараметры.ПутьКДаннымОбработкаНастройкиАдресВХранилище
																	, ОбработкаПараметры.ПрефиксОбработки
																	, ОбработкаПараметры.ИмяКонтрольнойПроцедуры
																	, ОбработкаПараметры.ПараметрыКонтрольнойПроцедуры);
																	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОбслуживанияОткрытие(Элемент, СтандартнаяОбработка)
	
	ктв_сб_ОбработкиОбслуживанияКлиент.ОбработкаОбслуживанияОткрытие(Элемент
																, СтандартнаяОбработка
																, ЭтаФорма
																, ОбработкаПараметры.ПутьКДаннымОбработкаАдресВХранилище
																, ОбработкаПараметры.ПутьКДаннымОбработкаНастройкиАдресВХранилище);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОбслуживанияОчистка(Элемент, СтандартнаяОбработка)
	
	ктв_сб_ОбработкиОбслуживанияКлиент.ОбработкаОбслуживанияОчистка(Элемент
															   , СтандартнаяОбработка
															   , ЭтаФорма
															   , ОбработкаПараметры.ПутьКДаннымОбработкаАдресВХранилище
															   , ОбработкаПараметры.ПутьКДаннымОбработкаПредставление);
															   
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьИдентификатор(Команда)
	
	Объект.Ид = СокрЛП(Новый УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

//Заполняем значения стандартных параметров для работы с обработками обслуживания
ОбработкаПараметры = Новый Структура();

//Начало имени обработки для отбора обработок конфигурации
ОбработкаПараметры.Вставить("ПрефиксОбработки"								, "ктв_сб_СобытияОбработчик");

//Путь к реквизиту объекта, в котором хранится обработка
ОбработкаПараметры.Вставить("ПутьКДаннымОбработка"							, "Обработка");

//Путь к реквизиту формы, в котором хранится адрес обработки во временном хранилище
ОбработкаПараметры.Вставить("ПутьКДаннымОбработкаАдресВХранилище"			, "ОбработкаАдресВХранилище");

//Путь к реквизиту формы, в котором хранится представление обработки
ОбработкаПараметры.Вставить("ПутьКДаннымОбработкаПредставление"				, "ОбработкаПредставление");

//Имя элемента формы, в котором выполняется выбор обработки обслуживания
ОбработкаПараметры.Вставить("ИмяЭлементаВыбораОбработкиНаФорме"				, "ОбработкаОбслуживания");

//Путь к реквизиту объекта, в котором хранятся настройки обработки
ОбработкаПараметры.Вставить("ПутьКДаннымОбработкаНастройки"					, "ОбработкаНастройки");

//Путь к реквизиту формы, в котором хранится адрес настроек обработки во временном хранилище
ОбработкаПараметры.Вставить("ПутьКДаннымОбработкаНастройкиАдресВХранилище"	, "ОбработкаНастройкиАдресВХранилище");

//Имя функции модуля объекта обработки, вызываемой для проверки, что обработка является обработкой обслуживания
ОбработкаПараметры.Вставить("ИмяКонтрольнойПроцедуры"						, "ЭтоОбработкаВыполненияОбработчика");

//Парметры функции, вызываемой для проверки
ОбработкаПараметры.Вставить("ПараметрыКонтрольнойПроцедуры"					, Неопределено);
